{"classes":["ORG","MONEY","DATE","DAYS","YEARS","PERCENT"],"annotations":[["Union Bank of India, a public sector lender, has modified the interest rates on fixed deposits below ₹2 crore. According to the bank's official website, the new interest rates are effective as of 14 September 2022.\r",{"entities":[[0,19,"ORG"],[101,110,"MONEY"],[196,213,"DATE"]]}],["Following the revision, the bank is now providing an interest rate on fixed deposits with maturities ranging from 7 days to 10 years of 3.00% to 5.80 per cent. \r",{"entities":[[114,120,"DAYS"],[124,132,"YEARS"],[136,141,"PERCENT"],[145,158,"PERCENT"]]}],["Currently, Union Bank of India is providing a maximum interest rate of 6.20% on fixed deposits maturing in 5 Years, 1 Day.\r",{"entities":[[11,30,"ORG"],[71,76,"PERCENT"],[107,114,"YEARS"],[116,121,"DAYS"]]}],["On fixed deposits maturing in 7 days to 45 days the bank will now offer an interest rate of 3.00% and on term deposits maturing in 46 -90 days the bank will now offer an interest rate of 4.05%.\r",{"entities":[[30,36,"DAYS"],[40,47,"DAYS"],[92,97,"PERCENT"],[131,142,"DAYS"],[187,193,"PERCENT"]]}],["Fixed deposits maturing in 91-180 days will now fetch an interest rate of 4.10% and term deposits maturing in 181 days to less than 1 year will now fetch an interest rate of 4.60%.\r",{"entities":[[27,38,"DAYS"],[74,79,"PERCENT"],[110,118,"DAYS"],[132,138,"YEARS"],[174,179,"PERCENT"]]}],["Union Bank of India will now offer an interest rate of 5.35% on fixed deposits maturing in 1 year and the bank will now fetch an interest rate of 5.45% on fixed deposits maturing in 1 year to 2 years.\r",{"entities":[[0,19,"ORG"],[55,60,"PERCENT"],[91,97,"YEARS"],[146,151,"PERCENT"],[182,199,"YEARS"]]}],["The bank will now provide an interest rate of 5.50% on fixed deposits maturing in years to 749 days and a rate of 6.15% on fixed deposits maturing in 750 days. \r",{"entities":[[46,51,"PERCENT"],[91,99,"DAYS"],[114,119,"PERCENT"],[150,158,"DAYS"]]}],["Fixed deposits with maturities between 750 days and three years will now pay interest at a rate of 5.50%, while term deposits with maturities between three years and five years will now pay interest at a rate of 5.75%.\r",{"entities":[[39,47,"DAYS"],[99,104,"PERCENT"],[150,161,"YEARS"],[166,176,"YEARS"],[212,218,"PERCENT"]]}],["For fixed deposits maturing in 5 years 1 day, Union Bank of India will now provide an interest rate of 6.20%, and the bank will also guarantee an interest rate of 5.80% for fixed deposits maturing in 5 years 1 day to 10 years.",{"entities":[[31,38,"YEARS"],[39,44,"DAYS"],[46,65,"ORG"],[103,108,"PERCENT"],[200,207,"YEARS"],[208,213,"DAYS"],[217,225,"YEARS"]]}],["For fixed deposits maturing in 5 years 1 day, Union Bank of India will now provide an interest rate of 6.20%, and the bank will also guarantee an interest rate of 5.80% for fixed deposits maturing in 5 years 1 day to 10 years.",{"entities":[[31,38,"YEARS"],[39,44,"DAYS"],[46,65,"ORG"],[103,108,"PERCENT"],[200,207,"YEARS"],[208,213,"DAYS"],[217,225,"YEARS"]]}]]}